//=============================================================================
//
//	背景処理 [bg.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _BG_H_
#define _BG_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define BG_SIZEX			(SCREEN_WIDTH)		// 背景のサイズX
#define BG_SIZEY			(960)				// 背景のサイズY

//*****************************************************************************
// 背景の構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;							// 位置
	D3DXVECTOR3 move;							// 移動量
	int nCounterAnim;							// アニメーションカウンター
	int nPatternAnimX;							// アニメーションパターンNo. X
	int nPatternAnimY;							// アニメーションパターンNo. Y
}Bg;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitBg(void);
void UninitBg(void);
void UpdateBg(void);
void DrawBg(void);

#endif