//=============================================================================
//
//	リザルトメニュー処理 [resultmenu.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _RESULTMENU_H_
#define _RESULTMENU_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// リザルトメニュー
//*****************************************************************************
typedef enum
{
	RESULTMENU_RESTART = 0,		// もう一回
	RESULTMENU_STAGESELECT,		// ステージ選択
	RESULTMENU_QUIT,			// 終了
	RESULTMENU_MAX
}RESULTMENU;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitResultMenu(void);
void UninitResultMenu(void);
void UpdateResultMenu(void);
void DrawResultMenu(void);
void SetResultMenu(RESULTMENU resultmenu);

#endif // _RESULTMENU_H_