//=============================================================================
//
//	影の処理 [shadow.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _SHADOW_H_
#define _SHADOW_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SHADOW_WIDTH			(25.0f)			// 影の幅
#define SHADOW_HEIGHT			(25.0f)			// 影の高さ
#define MAX_SHADOW				(256)				// 影の最大数

//*****************************************************************************
// 影の構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;							// 位置
	D3DXVECTOR3 rot;							// 向き
	D3DXMATRIX mtxWorld;						// ワールドマトリックス
	bool bUse;									// 使用状態
}Shadow;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitShadow(void);
void UninitShadow(void);
void UpdateShadow(void);
void DrawShadow(void);
int SetShadow(void);
void SetPositionShadow(int IdxShadow, D3DXVECTOR3 pos);

#endif