//=============================================================================
//
//	雪処理 [snow.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _SNOW_H_
#define _SNOW_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SNOW_WIDTH				(25.0f)			// 雪の幅
#define SNOW_HEIGHT				(25.0f)			// 雪の高さ

//*****************************************************************************
// 雪の構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;							// 位置
	float fRadius;								// 半径
	D3DXMATRIX mtxWorld;						// ワールドマトリックス
	int nIdxShadow;								// 影のインデックス
	bool bUse;									// 使用状態
}Snow;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitSnow(void);
void UninitSnow(void);
void UpdateSnow(void);
void DrawSnow(void);
void SetSnow(D3DXVECTOR3 pos, float fRadius);

#endif