//=============================================================================
//
//	雪処理 [snow.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _SNOW_H_
#define _SNOW_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SNOW_WIDTH				(25.0f)			// 雪の幅
#define SNOW_HEIGHT				(25.0f)			// 雪の高さ

//*****************************************************************************
// 雪の種類
//*****************************************************************************
typedef enum
{
	SNOWTYPE_000 = 0,
	SNOWTYPE_001,
	SNOWTYPE_002,
	SNOWTYPE_MAX
}SNOWTYPE;

//*****************************************************************************
// 雪の構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;							// 位置
	D3DXVECTOR3 move;							// 移動量
	float fRadius;								// 半径
	D3DXMATRIX mtxWorld;						// ワールドマトリックス
	SNOWTYPE type;								// 種類
	int nIdxShadow;								// 影のインデックス
	int nLife;									// 寿命
	bool bUse;									// 使用状態
}Snow;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitSnow(void);
void UninitSnow(void);
void UpdateSnow(void);
void DrawSnow(void);
void SetSnow(D3DXVECTOR3 pos, D3DXVECTOR3 move, float fRadius, SNOWTYPE type);

#endif