//=============================================================================
//
//	タイトル画面処理 [title.cpp]
//	Author : SHUMA AIZU
// 
//=============================================================================

#include "main.h"
#include "title.h"
#include "input.h"
#include "sound.h"
#include "fade.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_TITLE_UI		(4)

//*****************************************************************************
// グローバル変数
//*****************************************************************************
LPDIRECT3DTEXTURE9 g_pTextureTitle[MAX_TITLE_UI] = {};				// テクスチャへのポインタ
LPDIRECT3DVERTEXBUFFER9 g_pVtxBuffTitle = NULL;						// 頂点バッファへのポインタ
TITLESTATE g_titleState = TITLESTATE_OP;							// タイトルの状態
int g_nCounterTitleState = 0;										// 状態管理カウンター

//====================================
//	タイトルの初期化処理
//====================================
void InitTitle(void)
{
	g_titleState = TITLESTATE_OP;
}

//====================================
//	タイトルの終了処理
//====================================
void UninitTitle(void)
{

}

//====================================
//	タイトルの描画処理
//====================================
void DrawTitle(void)
{

}

//====================================
//	タイトルの更新処理
//====================================
void UpdateTitle(void)
{
	if (GetKeyboardTrigger(DIK_RETURN) == true)
	{
		SetFade(MODE_GAME, DEFAULT_FADESPEED, DEFAULT_FADESPEED);
	}
}

//========================================
//	タイトルの状態設定
//========================================
void SetTitleState(TITLESTATE titlestate)
{
	g_titleState = titlestate;
}

//========================================
//	タイトルの状態取得
//========================================
TITLESTATE GetTitleState(void)
{
	return g_titleState;
}