//=============================================================================
//
//	タイトルロゴ表示処理 [titlebg.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _TITLELOGO_H_
#define _TITLELOGO_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTitleLogo(void);
void UninitTitleLogo(void);
void UpdateTitleLogo(void);
void DrawTitleLogo(void);

#endif
