//=============================================================================
//
//	壁の処理 [wall.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _WALL_H_
#define _WALL_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define WALL_WIDTH			(100.0f)			// 壁の幅
#define WALL_HEIGHT			(50.0f)				// 壁の高さ
#define MAX_WALL			(4)					// 壁の最大数

//*****************************************************************************
// 壁の構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;							// 位置
	D3DXVECTOR3 rot;							// 向き
	D3DXMATRIX mtxWorld;						// ワールドマトリックス
	bool bUse;									// 使用状態
}Wall;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitWall(void);
void UninitWall(void);
void UpdateWall(void);
void DrawWall(void);
void SetWall(D3DXVECTOR3 pos, D3DXVECTOR3 rot);
void SetPositionWall(int IdxWall, D3DXVECTOR3 pos);

#endif